In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)

In [4]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [6]:
df

                   A         B         C         D
2013-01-01 -0.202208  0.095044 -0.540376 -0.073797
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-05 -0.358507  0.623756  0.199804  0.827919
2013-01-06  0.570679 -1.039604  0.225609 -0.475395

In [7]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [8]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df2.any

<bound method DataFrame.any of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [11]:
df.head()

                   A         B         C         D
2013-01-01 -0.202208  0.095044 -0.540376 -0.073797
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-05 -0.358507  0.623756  0.199804  0.827919

In [12]:
df.tail(-2)

                   A         B         C         D
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-05 -0.358507  0.623756  0.199804  0.827919
2013-01-06  0.570679 -1.039604  0.225609 -0.475395

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [15]:
df.values

array([[-0.20220775,  0.09504363, -0.54037567, -0.07379716],
       [ 0.84755363,  1.60012103,  0.92261008,  0.28121541],
       [ 0.92157218,  1.38199506,  1.31568259, -0.85010825],
       [ 0.63778419, -0.28555185,  1.26630846, -2.12776069],
       [-0.35850708,  0.62375582,  0.19980395,  0.82791875],
       [ 0.57067883, -1.03960418,  0.22560878, -0.47539476]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.402812  0.395960  0.564940 -0.402988
std    0.546983  1.008961  0.728513  1.026804
min   -0.358507 -1.039604 -0.540376 -2.127761
25%   -0.008986 -0.190403  0.206255 -0.756430
50%    0.604232  0.359400  0.574109 -0.274596
75%    0.795111  1.192435  1.180384  0.192462
max    0.921572  1.600121  1.315683  0.827919

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.202208    0.847554    0.921572    0.637784   -0.358507    0.570679
B    0.095044    1.600121    1.381995   -0.285552    0.623756   -1.039604
C   -0.540376    0.922610    1.315683    1.266308    0.199804    0.225609
D   -0.073797    0.281215   -0.850108   -2.127761    0.827919   -0.475395

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.073797 -0.540376  0.095044 -0.202208
2013-01-02  0.281215  0.922610  1.600121  0.847554
2013-01-03 -0.850108  1.315683  1.381995  0.921572
2013-01-04 -2.127761  1.266308 -0.285552  0.637784
2013-01-05  0.827919  0.199804  0.623756 -0.358507
2013-01-06 -0.475395  0.225609 -1.039604  0.570679

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.570679 -1.039604  0.225609 -0.475395
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-01 -0.202208  0.095044 -0.540376 -0.073797
2013-01-05 -0.358507  0.623756  0.199804  0.827919
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-02  0.847554  1.600121  0.922610  0.281215

## Selection

In [20]:
df['a']

KeyError: 'a'

In [ ]:
df['A']

In [21]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.202208  0.095044 -0.540376 -0.073797
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108

In [22]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761

### Selection by Label

In [23]:
df.loc[dates[0]]

A   -0.202208
B    0.095044
C   -0.540376
D   -0.073797
Name: 2013-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.202208  0.095044
2013-01-02  0.847554  1.600121
2013-01-03  0.921572  1.381995
2013-01-04  0.637784 -0.285552
2013-01-05 -0.358507  0.623756
2013-01-06  0.570679 -1.039604

In [31]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.514404 -1.142166
2013-01-03 -0.494699  0.192930
2013-01-04  1.550761  0.005029

In [32]:
df.loc['20130102',['A','B']]

A   -0.514404
B   -1.142166
Name: 2013-01-02 00:00:00, dtype: float64

In [33]:
df.loc[dates[0],'A']

1.842079809250744

In [34]:
df.at[dates[0],'A']

1.842079809250744

Which is the difference between the two? Caan ```at``` be used to assign?

### Selection by Position

In [36]:
df.iloc[3]

A    1.550761
B    0.005029
C   -1.286642
D   -1.248313
Name: 2013-01-04 00:00:00, dtype: float64

In [37]:
df.iloc[3:5, 1:2]

                   B
2013-01-04  0.005029
2013-01-05  0.248315

In [38]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.514404  0.895834
2013-01-03 -0.494699 -1.275506
2013-01-05  0.211101 -0.554812

In [39]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.249441 -0.415786
2013-01-02 -1.142166  0.895834
2013-01-03  0.192930 -1.275506
2013-01-04  0.005029 -1.286642
2013-01-05  0.248315 -0.554812
2013-01-06 -1.703413 -1.780134

In [40]:
df.iloc[1,1]

-1.1421658244034147

In [42]:
df.iat[1,1]

-1.1421658244034147

## Boolean Indexing

In [44]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  1.842080 -0.249441 -0.415786  0.322635
2013-01-04  1.550761  0.005029 -1.286642 -1.248313
2013-01-05  0.211101  0.248315 -0.554812  1.457328

In [45]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.842080       NaN       NaN  0.322635
2013-01-02       NaN       NaN  0.895834  0.098191
2013-01-03       NaN  0.192930       NaN       NaN
2013-01-04  1.550761  0.005029       NaN       NaN
2013-01-05  0.211101  0.248315       NaN  1.457328
2013-01-06       NaN       NaN       NaN  0.985062

Did not exactly understood this result: NaN not subselection?

In [25]:
df2 = df.copy()

df2['E'] = ['one', 'one','two','three','four','three']

df2

                   A         B         C         D      E
2013-01-01 -0.202208  0.095044 -0.540376 -0.073797    one
2013-01-02  0.847554  1.600121  0.922610  0.281215    one
2013-01-03  0.921572  1.381995  1.315683 -0.850108    two
2013-01-04  0.637784 -0.285552  1.266308 -2.127761  three
2013-01-05 -0.358507  0.623756  0.199804  0.827919   four
2013-01-06  0.570679 -1.039604  0.225609 -0.475395  three

In [26]:
 df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.921572  1.381995  1.315683 -0.850108   two
2013-01-05 -0.358507  0.623756  0.199804  0.827919  four

### Setting

In [27]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [30]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.540376 -0.073797
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-05 -0.358507  0.623756  0.199804  0.827919
2013-01-06  0.570679 -1.039604  0.225609 -0.475395

In [32]:
df.iat[0,1] = 0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.540376 -0.073797
2013-01-02  0.847554  1.600121  0.922610  0.281215
2013-01-03  0.921572  1.381995  1.315683 -0.850108
2013-01-04  0.637784 -0.285552  1.266308 -2.127761
2013-01-05 -0.358507  0.623756  0.199804  0.827919
2013-01-06  0.570679 -1.039604  0.225609 -0.475395

In [34]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.540376  5
2013-01-02  0.847554  1.600121  0.922610  5
2013-01-03  0.921572  1.381995  1.315683  5
2013-01-04  0.637784 -0.285552  1.266308  5
2013-01-05 -0.358507  0.623756  0.199804  5
2013-01-06  0.570679 -1.039604  0.225609  5

In [35]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.540376 -5
2013-01-02 -0.847554 -1.600121 -0.922610 -5
2013-01-03 -0.921572 -1.381995 -1.315683 -5
2013-01-04 -0.637784 -0.285552 -1.266308 -5
2013-01-05 -0.358507 -0.623756 -0.199804 -5
2013-01-06 -0.570679 -1.039604 -0.225609 -5

### Missing Data

In [36]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1],'E'] = 1


df1

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.540376  5  1.0
2013-01-02  0.847554  1.600121  0.922610  5  1.0
2013-01-03  0.921572  1.381995  1.315683  5  NaN
2013-01-04  0.637784 -0.285552  1.266308  5  NaN

In [37]:
df1.dropna(how='any')

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.540376  5  1.0
2013-01-02  0.847554  1.600121  0.922610  5  1.0

In [38]:
df1.fillna(value=5)

                   A         B         C  D    E
2013-01-01  0.000000  0.000000 -0.540376  5  1.0
2013-01-02  0.847554  1.600121  0.922610  5  1.0
2013-01-03  0.921572  1.381995  1.315683  5  5.0
2013-01-04  0.637784 -0.285552  1.266308  5  5.0

In [39]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

### Operations

In [40]:
df.mean()

A    0.436514
B    0.380119
C    0.564940
D    5.000000
dtype: float64

In [41]:
df.mean(1)

2013-01-01    1.114906
2013-01-02    2.092571
2013-01-03    2.154812
2013-01-04    1.654635
2013-01-05    1.366263
2013-01-06    1.189171
Freq: D, dtype: float64

In [42]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [43]:
df.sub(s, axis='index')
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.540376  5
2013-01-02  0.847554  1.600121  0.922610  5
2013-01-03  0.921572  1.381995  1.315683  5
2013-01-04  0.637784 -0.285552  1.266308  5
2013-01-05 -0.358507  0.623756  0.199804  5
2013-01-06  0.570679 -1.039604  0.225609  5

### Apply

In [44]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.540376   5
2013-01-02  0.847554  1.600121  0.382234  10
2013-01-03  1.769126  2.982116  1.697917  15
2013-01-04  2.406910  2.696564  2.964225  20
2013-01-05  2.048403  3.320320  3.164029  25
2013-01-06  2.619082  2.280716  3.389638  30

In [45]:
df.apply(lambda x: x.max() - x.min())

A    1.280079
B    2.639725
C    1.856058
D    0.000000
dtype: float64

### Histogramming

In [46]:
s = pd.Series(np.random.randint(0, 7, size=10))

s

0    3
1    2
2    4
3    3
4    3
5    6
6    6
7    6
8    0
9    0
dtype: int64

In [47]:
s.value_counts()

6    3
3    3
0    2
4    1
2    1
dtype: int64

### String Methods

In [49]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

In [51]:
df = pd.DataFrame(np.random.randn(10, 4))

In [52]:
df

          0         1         2         3
0  0.255947  0.182842 -0.253639 -0.913419
1 -0.162016  0.089505 -0.209175  0.041355
2 -0.507299  0.707307  0.959776 -0.120633
3  0.498238 -0.824006  2.029908 -0.037341
4 -1.299759  0.096632 -0.557939  0.356278
5 -0.590575 -1.586391  0.323514  0.490125
6 -0.167050  0.529371  1.279384 -0.812078
7 -0.804002  1.582105 -0.839349  1.986138
8  0.058244 -0.522320 -1.622707  1.085104
9  0.896553 -0.854955  0.891919 -0.404235

In [53]:
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

          0         1         2         3
0  0.255947  0.182842 -0.253639 -0.913419
1 -0.162016  0.089505 -0.209175  0.041355
2 -0.507299  0.707307  0.959776 -0.120633
3  0.498238 -0.824006  2.029908 -0.037341
4 -1.299759  0.096632 -0.557939  0.356278
5 -0.590575 -1.586391  0.323514  0.490125
6 -0.167050  0.529371  1.279384 -0.812078
7 -0.804002  1.582105 -0.839349  1.986138
8  0.058244 -0.522320 -1.622707  1.085104
9  0.896553 -0.854955  0.891919 -0.404235

### Join

In [55]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

left

   key  lval
0  foo     1
1  foo     2

In [56]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

right

   key  rval
0  foo     4
1  foo     5

In [57]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [58]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

left

   key  lval
0  foo     1
1  bar     2

In [60]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

right

   key  rval
0  foo     4
1  bar     5

In [61]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

### Append

In [62]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

df

          A         B         C         D
0 -0.106715 -0.867026 -0.510737  1.358553
1 -0.297041 -0.564862  0.395730 -1.678092
2 -0.786407 -1.929516 -1.288289 -0.340084
3 -0.315426  0.880463  1.028753 -0.305122
4 -1.157776 -1.926153 -0.690803  0.727513
5 -1.292191 -0.531878 -0.993262  0.028663
6  2.299047  1.501696  0.750924  0.708009
7  1.357162 -0.094100  0.093490 -0.445660

In [63]:
 s = df.iloc[3]
    
s

A   -0.315426
B    0.880463
C    1.028753
D   -0.305122
Name: 3, dtype: float64

In [64]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.106715 -0.867026 -0.510737  1.358553
1 -0.297041 -0.564862  0.395730 -1.678092
2 -0.786407 -1.929516 -1.288289 -0.340084
3 -0.315426  0.880463  1.028753 -0.305122
4 -1.157776 -1.926153 -0.690803  0.727513
5 -1.292191 -0.531878 -0.993262  0.028663
6  2.299047  1.501696  0.750924  0.708009
7  1.357162 -0.094100  0.093490 -0.445660
8 -0.315426  0.880463  1.028753 -0.305122

## Grouping

In [65]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                           'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

df

     A      B         C         D
0  foo    one -0.622429  2.533815
1  bar    one  2.189834  2.033445
2  foo    two -2.022555  0.252097
3  bar  three  0.312779 -0.274410
4  foo    two -1.766890  1.461052
5  bar    two  0.411409  0.045673
6  foo    one -0.191195 -0.017367
7  foo  three  0.474431 -0.352896

In [66]:
df.groupby('A').sum()

            C         D
A
bar  2.914022  1.804708
foo -4.128637  3.876700

In [67]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    2.189834  2.033445
    three  0.312779 -0.274410
    two    0.411409  0.045673
foo one   -0.813624  2.516447
    three  0.474431 -0.352896
    two   -3.789444  1.713149

## Reshaping

###  Stack

In [68]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [69]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

index

MultiIndex(levels=[[u'bar', u'baz', u'foo', u'qux'], [u'one', u'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=[u'first', u'second'])

In [71]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

df

                     A         B
first second
bar   one     0.663218  1.337845
      two     0.966364  0.781579
baz   one     0.641644 -0.799571
      two    -0.115802  1.311738
foo   one     1.257968 -0.357409
      two     0.222954  0.653339
qux   one    -0.286286  0.007363
      two    -0.005796  0.768866

In [72]:
df2 = df[:4]

df2

                     A         B
first second
bar   one     0.663218  1.337845
      two     0.966364  0.781579
baz   one     0.641644 -0.799571
      two    -0.115802  1.311738

In [73]:
stacked = df2.stack()

stacked

first  second
bar    one     A    0.663218
               B    1.337845
       two     A    0.966364
               B    0.781579
baz    one     A    0.641644
               B   -0.799571
       two     A   -0.115802
               B    1.311738
dtype: float64

### Pivot Tables

In [2]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                    'B' : ['A', 'B', 'C'] * 4,
                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                    'D' : np.random.randn(12),
                    'E' : np.random.randn(12)})

df

        A  B    C         D         E
0     one  A  foo -2.196797 -1.415023
1     one  B  foo -0.984098  0.130058
2     two  C  foo  0.519552 -0.001120
3   three  A  bar -0.525252  0.644892
4     one  B  bar  1.345589  1.181627
5     one  C  bar  0.686937  0.335404
6     two  A  foo -1.461104  0.146572
7   three  B  foo -2.220063  0.822753
8     one  C  foo  0.126834 -1.203998
9     one  A  bar -0.372765  1.691905
10    two  B  bar -0.258286 -0.301464
11  three  C  bar -1.080150 -0.570121

In [3]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.372765 -2.196797
      B  1.345589 -0.984098
      C  0.686937  0.126834
three A -0.525252       NaN
      B       NaN -2.220063
      C -1.080150       NaN
two   A       NaN -1.461104
      B -0.258286       NaN
      C       NaN  0.519552

## Time Series

In [4]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [5]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts

2012-01-01 00:00:00     36
2012-01-01 00:00:01     60
2012-01-01 00:00:02    401
2012-01-01 00:00:03    378
2012-01-01 00:00:04    191
2012-01-01 00:00:05    438
2012-01-01 00:00:06    364
2012-01-01 00:00:07    388
2012-01-01 00:00:08    390
2012-01-01 00:00:09    278
2012-01-01 00:00:10    379
2012-01-01 00:00:11    373
2012-01-01 00:00:12    224
2012-01-01 00:00:13    323
2012-01-01 00:00:14    118
2012-01-01 00:00:15    339
2012-01-01 00:00:16    305
2012-01-01 00:00:17    106
2012-01-01 00:00:18    283
2012-01-01 00:00:19    138
2012-01-01 00:00:20    451
2012-01-01 00:00:21    415
2012-01-01 00:00:22     66
2012-01-01 00:00:23     45
2012-01-01 00:00:24     81
2012-01-01 00:00:25    415
2012-01-01 00:00:26    196
2012-01-01 00:00:27    468
2012-01-01 00:00:28    476
2012-01-01 00:00:29    223
                      ...
2012-01-01 00:01:10    364
2012-01-01 00:01:11    248
2012-01-01 00:01:12    124
2012-01-01 00:01:13    389
2012-01-01 00:01:14     64
2012-01-01 00:01:15    107
2012-01-01 00:01:16    190
2012-01-01 00:01:17     43
2012-01-01 00:01:18     18
2012-01-01 00:01:19    261
2012-01-01 00:01:20     94
2012-01-01 00:01:21    136
2012-01-01 00:01:22    140
2012-01-01 00:01:23    386
2012-01-01 00:01:24    208
2012-01-01 00:01:25    418
2012-01-01 00:01:26    213
2012-01-01 00:01:27    458
2012-01-01 00:01:28    265
2012-01-01 00:01:29    217
2012-01-01 00:01:30      8
2012-01-01 00:01:31    421
2012-01-01 00:01:32    308
2012-01-01 00:01:33     43
2012-01-01 00:01:34    389
2012-01-01 00:01:35    267
2012-01-01 00:01:36    398
2012-01-01 00:01:37    183
2012-01-01 00:01:38    151
2012-01-01 00:01:39    198
Freq: S, Length: 100, dtype: int64

In [6]:
ts.resample('5Min').sum()

2012-01-01    24633
Freq: 5T, dtype: int64

Skipping timezone transformations and representations.

## Categoricals

In [7]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [9]:
df["grade"] = df["raw_grade"].astype("category")

df

   id raw_grade grade
0   1         a     a
1   2         b     b
2   3         b     b
3   4         a     a
4   5         a     a
5   6         e     e

In [10]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [11]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [12]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [13]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [14]:
df.groupby("grade")

In [15]:
 df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Plotting

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))